Ran Plan for dir: `opentofu` workspace: `prod`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/tofu plan -input=false -refresh -out "/atlantis-data/repos/opentoucan/infrastructure-config/19/prod/opentofu/prod-prod.tfplan" -var-file ./env/prod.tfvars -var environment=prod -var-file /atlantis-data/repos/opentoucan/infrastructure-config/19/prod/opentofu/env/prod.tfvars' in '/atlantis-data/repos/opentoucan/infrastructure-config/19/prod/opentofu': exit status 1
data.mongodbatlas_roles_org_id.org: Reading...
module.hetzner-vps.data.hcloud_datacenters.all: Reading...
module.hetzner-vps.hcloud_ssh_key.ssh_key["ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIHz/h+WzkR+AZYNvfzdbp/lUFIqdew+xErtSirm1XhPS"]: Refreshing state... [id=29065654]
module.hetzner-vps.hcloud_firewall.firewall: Refreshing state... [id=2127713]
module.cloudflare-dns.data.cloudflare_zones.opentoucan: Reading...
module.hetzner-vps.data.hcloud_datacenters.all: Read complete after 1s [id=5dd4ebdac62609c834f7768f02286b798bd82a38]
module.hetzner-vps.hcloud_primary_ip.primary_ip: Refreshing state... [id=89499765]
data.mongodbatlas_roles_org_id.org: Read complete after 2s [id=658b082bf98c657b2c969a5b]
data.mongodbatlas_team.teams["devops"]: Reading...
data.mongodbatlas_team.teams["developers"]: Reading...
module.cloudflare-dns.data.cloudflare_zones.opentoucan: Read complete after 1s [name=opentoucan.com]
data.mongodbatlas_team.teams["devops"]: Read complete after 0s [id=aWQ=:NjVkNGY1MTdlMDk4OTM3NDY2ZmEzZTdm-b3JnX2lk:NjU4YjA4MmJmOThjNjU3YjJjOTY5YTVi]
data.mongodbatlas_team.teams["developers"]: Read complete after 0s [id=aWQ=:NjVkNGEzYmVlNTA3ODQwNTY3OGJiZmUz-b3JnX2lk:NjU4YjA4MmJmOThjNjU3YjJjOTY5YTVi]
module.mongodb.mongodbatlas_project.project: Refreshing state... [id=65d4a3bf160f504f2547c2cd]
module.hetzner-vps.hcloud_server.server: Refreshing state... [id=64755162]
module.cloudflare-dns.cloudflare_dns_record.dns_record: Refreshing state... [id=228371bde09ff7188598f4df8a3b835c]
module.mongodb.mongodbatlas_project_ip_access_list.ip_access_list["0.0.0.0/0"]: Refreshing state... [id=ZW50cnk=:MC4wLjAuMC8w-cHJvamVjdF9pZA==:NjVkNGEzYmYxNjBmNTA0ZjI1NDdjMmNk]
module.mongodb.mongodbatlas_cluster.cluster["discord-bot"]: Refreshing state... [id=Y2x1c3Rlcl9pZA==:NjVkNGI3ODEzMTkxN2EwYzE0MThjZjVj-Y2x1c3Rlcl9uYW1l:ZGlzY29yZC1ib3Q=-cHJvamVjdF9pZA==:NjVkNGEzYmYxNjBmNTA0ZjI1NDdjMmNk-cHJvdmlkZXJfbmFtZQ==:VEVOQU5U]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu planned the following actions, but then encountered a problem:

  # module.cloudflare-dns.cloudflare_dns_record.dns_record will be updated in-place
  ~ resource "cloudflare_dns_record" "dns_record" {
      + comment             = (known after apply)
      + comment_modified_on = (known after apply)
      ~ created_on          = "2025-05-23T19:10:42Z" -> (known after apply)
        id                  = "228371bde09ff7188598f4df8a3b835c"
      ~ meta                = jsonencode({}) -> (known after apply)
      ~ modified_on         = "2025-05-25T12:59:03Z" -> (known after apply)
      ~ name                = "postgres.opentoucan.com" -> "postgres"
      ~ proxiable           = true -> (known after apply)
      ~ settings            = {
          + flatten_cname = (known after apply)
          + ipv4_only     = (known after apply)
          + ipv6_only     = (known after apply)
        } -> (known after apply)
      ~ tags                = [] -> (known after apply)
      + tags_modified_on    = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
╷
│ Error: Invalid for_each argument
│ 
│   on provider.tf line 23, in module "s3":
│   23:   for_each = var.s3_bucket_names
│     ├────────────────
│     │ var.s3_bucket_names is list of string with 2 elements
│ 
│ The given "for_each" argument value is unsuitable: the "for_each" argument
│ must be a map, or set of strings, and you have provided a value of type
│ list of string.
╵


```
</details>